src/Documents/ОбязательствоСоблюденияРКПД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ОбязательствоСоблюденияРКПД</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОбязательства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПоложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Documents/ОбязательствоСоблюденияРКПД/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ПрикладныеФункцииИПроцедуры
&НаСервере
Процедура ЗаполнитьТекстом()
	Элементы.ДекорацияТекстОбязательства.Заголовок = "Я, " + Объект.Подписант.ПолноеИмя
									      + ", серия паспорта " + Объект.Подписант.СерияПаспорта
									 	  + ", номер паспорта " + Объект.Подписант.НомерПаспорта
									 	  + ", выдан " + Объект.Подписант.ПаспортКемВыдан
									 	  + ", " + Объект.Подписант.ПаспортКогдаВыдан
									 	  + ", адрес регистрации: " + Объект.Подписант.АдресРегистрации + ", ";
	Если Объект.ТекстОбязательства = "" Тогда
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
									      + Константы.ТекстОбязательстваКонфПД.Получить();
	Иначе
		Элементы.ДекорацияТекстОбязательства.Заголовок = Элементы.ДекорацияТекстОбязательства.Заголовок
										  + Объект.ТекстОбязательства;   
	КонецЕсли;      
									  
	Если Объект.ТекстПоложения = "" Тогда
   		Элементы.ДекорацияТекстПоложения.Заголовок = Константы.ТекстПоложенияОЗащитеПД.Получить();
	Иначе
		Элементы.ДекорацияТекстПоложения.Заголовок = Объект.ТекстПоложения;	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПоказатьТекст()
	ЗаполнитьТекстом();
	Элементы.Страницы.Видимость = Истина;
КонецПроцедуры

&НаСервере
Процедура СкрытьТекст()
	Элементы.Страницы.Видимость = Ложь;	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВидимостьТекста()
	Если Объект.Подписант.Пустая() Тогда
		СкрытьТекст();
	Иначе
		ПоказатьТекст();
	КонецЕсли;
КонецПроцедуры

Процедура ОбновитьДоступностьФормы()
	ЭтаФорма.ТолькоПросмотр = Объект.Подписан;
	ЭтаФорма.КоманднаяПанель.Доступность = Не Объект.Подписан;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытий
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновитьВидимостьТекста();
	ОбновитьДоступностьФормы();
КонецПроцедуры

&НаКлиенте
Процедура ПодписантПриИзменении(Элемент)
	ОбновитьВидимостьТекста();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.ТекстОбязательства = Элементы.ДекорацияТекстОбязательства.Заголовок;
	Объект.ТекстПоложения     = Элементы.ДекорацияТекстПоложения.Заголовок;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Сотрудник = Объект.Подписант.ПолучитьОбъект();
	Сотрудник.ОбязательствоСоблюденияРКПД = ТекущийОбъект.Ссылка;
	Сотрудник.Записать();
КонецПроцедуры
#КонецОбласти
